import 'package:draggable_scrollbar/draggable_scrollbar.dart';
import 'package:flutter/material.dart';
import 'package:font_awesome_flutter/font_awesome_flutter.dart';
import 'package:TheSpecialParty/constants.dart';

class TermsAndConditions extends StatefulWidget {
  @override
  _TermsAndConditionsState createState() => _TermsAndConditionsState();
}

class _TermsAndConditionsState extends State<TermsAndConditions> {
  ScrollController _rrectController = ScrollController();
  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        appBar: AppBar(
            leading: SizedBox(width: 0),
            actions: [
              Padding(
                padding: const EdgeInsets.only(left: 30),
                child: InkWell(
                  onTap: () {
                    Navigator.pop(context);
                  },
                  child: Icon(
                    FontAwesomeIcons.chevronLeft,
                    color: Colors.white,
                    size: 20,
                  ),
                ),
              )
            ],
            title: Center(
              child: Text(
                'الشروط الاحكام',
                style: TextStyle(
                    color: Colors.white, fontSize: 21, fontFamily: 'hayah'),
              ),
            ),
            elevation: 0,
            backgroundColor: pinktheme),
        body: Container(
            width: double.infinity,
            decoration: BoxDecoration(
              borderRadius: BorderRadius.only(
                topLeft: Radius.circular(60),
                topRight: Radius.circular(60),
              ),
              color: Color(0xFFF8F8F8),
            ),
            child: Padding(
              padding: const EdgeInsets.symmetric(horizontal: 4,vertical:30),
              child: DraggableScrollbar.rrect(

                controller: _rrectController,
                backgroundColor: pinktheme,
              heightScrollThumb: 50,
                alwaysVisibleScrollThumb: true,
                              child: ListView(
                                controller: _rrectController,
                  
                   children: [
                   Padding(
                     padding: const EdgeInsets.only(
                    right: 25, left: 25, top: 0, bottom: 0),
                     child: Column(
                       children: [
                          Padding(
                        padding: const EdgeInsets.symmetric(vertical: 10),
                        child: Center(
                          child: Text(
                            'الشروط والاحكام لتطبيق الحفلة المميزة',
                            style: TextStyle(
                                fontFamily: 'hayah',
                                fontSize: 20,
                                color: Colors.blue),
                          ),
                        ),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 10),
                        child: Text(
                          'اعتماد الاتفاقية ',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Text(
                        'لكي تصبح عضواً في موقع الحفلة المميزة يتعين عليك في البداية أن تقوم بتعبئة بيانات الطلب والتي تعتبر بمثابة التسجيل ، ثم الموافقة والتعهد على الالتزام بأحكام إتفاقية مستخدم موقع الحفلة المميزة ، وعند تعبئة واعتماد استمارة التسجيل أو الحصول على أية خدمات أو منتجات باستخدام الموقع؛ فإنك بموجب هذا توافق على الالتزام باتفاقية مستخدم موقع الحفلة المميزة انت مسؤول عن اجراء كافة الترتيبات اللازمة لكي تقوم بالولوج الى الموقع على الشبكة، كما أنك مسؤول أيضا عن ضمان أن كافة الاشخاص الذين يدخلون إلى الموقع عن طريق وصلة الانترنت الخاصة بك على علم بشروط هذا الموقع، والتزامهم بها. وعند عرض أو تصفح أو استخدام أو الدخول الى الموقع أو تقديم أي محتوى أو مواد الى الموقع، فإنك توافق على شروط الاستخدام الماثلة كاتفاق قانوني ملزم بينك وبين موقع الحفلة المميزة بدون قيد او شرط. ان مصطلح "أنت" سوف يشير الى أي شخص او كيان يقوم بعرض أو استخدام أو الدخول أو تصفح الموقع أو تقديم أي محتوى أو مواد إلى الموقع. في حالة عدم موافقتك على شروط الاستخدام الماثلة، فلا يجوز لك استخدام الموقع. يحتفظ موقع الحفلة المميزة بحق تعديل شروط الاستخدام الماثلة في أي وقت وبدون اشعار مسبق، وأنك توافق على أن كل زيارة تقوم بها إلى المواقع سوف تخضع إلى شروط الاستخدام السارية المفعول في ذلك الوقت، وأن استمرار إستخدام الموقع الآن أو بعد التعديلات على شروط الاستخدام الماثلة يؤكد على أنك قمت بقراءة وقبول والموافقة على الالتزام بهذه التعديلات. هذه الشروط والأحكام تطبق على موقع الحفلة المميزة وجميع تطبيقاته على أجهزة الآيفون، الآيباد، الأندرويد والهاتف المتصل بمتصفح الإنترنت',
                        style: TextStyle(
                          fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,
                        ),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          'وصف الخدمات',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Text(
                        'يسمح موقع الحفلة المميزة لأعضاءه الذين يوافقون على الاتفاقية بطلب باقات الورد و الزهور من الموقع على الانترنت. يقدم لك موقع الحفلة المميزة طريقة سهلة لاختيار باقات ورد مميزة من خلال الموقع و ايصالها لأحبابك. إن غرض هذا الموقع هو تبسيط عملية شراء باقات الورد للعملاء و ايصالها لاحبابهم اينما كانوا في دولة المملكة العربية السعودية  ، وتسمح قوائم الباقات للعملاء بإختيار الباقات المفضلة بطريقة سهلة وسريعة حسب المناسبة التي يختارها العميل. لقد أنشأنا الموقع ليكون محل ورد و زهور الكتروني تجاري يسهل على العميل مشاركة احبابه بمشاعرهم من خلال ارسال باقة ورد لهم عبر استخدام الانترنت. إن موقع الحفلة المميزة يقوم بشكل مباشر بتصميم و إعداد جميع باقات الورد المعروضه على الموقع ، و تسويق الموقع عبر القنوات الالكترونيه و توفير إمكانية البحث والعثور على باقات ورد و زهور في الموقع، و يتم توصيل هذه الباقات الى العناوين المذكوره بالطلب. وإن موقع الحفلة المميزة مسئول عن الإلتزام بالقوانين واللوائح والانظمة والمقاييس والمعايير المطبقة في المملكة مثل التي تتعلق بإعداد و بتحضير وبيع وتسويق وسلامة الزهور و النباتات. إن المشترين لباقات الورد وحدهم مسؤولين عن التأكد من صحة عناوين التوصيل ولن يكون على موقع الحفلة المميزة أي التزام أو مسؤولية عن أية عناوين خاطئة عن مستلم الباقة. إن كافة عمليات إعداد وتوصيل باقات الورد و الزهور هي مسؤولية موقع الحفلة المميزة الذي يقبل الطلبية سوف نقوم باتخاذ كافة الوسائل الممكنة التي تمكننا القيام بها للوفاء بوقت التوصيل المحدد، ومع ذلك قد يتأثر وقت التوصيل بعوامل خارج سيطرتنا ولذلك لا يمكن ضمانها. وسوف نبلغكم في حالة علمنا بأي تأخير غير متوقع',
                        style: TextStyle(
                            fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          'كيف يتم طلب باقة ورد',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          'عند قيامك باختيار طلب من قائمة الباقات المتوفرة في الموقع، فأنت تستطيع تقديم طلبك بالضغط على زر "اطلب الآن". يرجى الملاحظة أنه من المهم أن تقوم بمراجعة المعلومات التي تقوم بإدخالها وتصحيح أي أخطاء قبل الضغط على زر "الدفع" ، نظرا لأنه عند الضغط على هذا الادخال فسوف لا يمكن تصحيح الاخطاء. وعند استلامنا طلبك، سوف يبدأ موقع الحفلة المميزة في تنفيذ الطلب وسوف نرسل رسالة في الصفحة النهائية تُفيد بأنه قد تم استلام طلبك بنجاح. وعندما تقوم بالدفع بطريقة غير مصرح بها، سوف يتم اعادتك الى الصفحة السابقة على الموقع ولن نكون ملزمين بتقديم الخدمات',
                          style: TextStyle(
                             fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,),
                        ),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          'الغاء الطلب',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Text(
                        'يحق لك إلغاء الطلب خلال (5) دقائق من تقديم الطلب وذلك بالتواصل معنا على الواتساب المدون بالموقع. بالرغم من بذل كل جهد لضمان الحفاظ على الأسعار والأوصاف الصحيحة، إلا أننا نحتفظ بحق إلغاء أي طلب يحتوي على معلومات غير صحيحة. يحتفظ موقع الحفلة المميزة بحق إلغاء أي طلب بعد القبول و استلامك رسالة التأكيد ، وسوف نقوم بإبلاغك فوراً بأي إلغاء مذكور .',
                        style: TextStyle(
                             fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          'مسئولية العضو',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Text(
                        'خلال استخدام خدمات موقع الحفلة المميزة يقبل العضو ويقر بما يلي : ان المعلومات الواردة في استمارة التسجيل صحيحة، بشرط ان تكون هذه المعلومات مطلوبة، وأن العضو هو المسؤول وحده عن أية خسائر قد تنشأ عن أية معلومات خاطئة او معلومات غير كافية (على سبيل المثال نسيان كلمة السر) وفي تلك الحالات يتم انهاء عضويته. ان العضو هو وحده المسؤول عن كافة الافكار والاراء والبيانات الشخصية التي يذكرها اثناء استخدامه خدمات موقع الحفلة المميزة وكذلك مسؤولا عن كافة الملفات التي يتم تحميلها الى الموقع والمعلومات الشخصية المرسلة، وإن الموقع لن يكون مسؤول بأي شكل من الأشكال عن تلك الملفات، أو عن الولوج الى أي خدمات مقدمة عبر الموقع يكون غير مصرح بها أو بأي طريقة أخرى غير تلك المحددة بواسطة الموقع ، وعدم تغيير البرمجيات باي طريقة، وتعويض الموقع عن كافة الخسائر المادية والادبية في حالة عدم التزام العضو بالمواد المذكورة أعلاه سوف تلغى عضويته . ولن يكون الموقع مسؤول عن أي اضرار قد تنشأ عن قراءة البيانات العائدة الى أي أعضاء بواسطة أي افراد غير مصرح لهم. ويجب على العضو عدم ارسال أي رسائل تكون تهديدية، أو غير أخلاقية، أو عنصرية أومناقضة لقوانين المملكة والاتفاقيات الدولية. وأي مراسلات أو عناوين أو اسماء مستعارة يجب ألا تكون مخالفة للوائح والآداب العامة والسلوك الحسن والقوانين. ويلتزم بعدم مضايقة و/أو تهديد المستخدمين الآخرين، أو أي من موظفي خدمة العملاء التابعين للموقع ، وعدم التصرف بطريقة تؤثر على استخدام الخدمات من قبل المستخدمين الاخرين، وعدم ارسال، طباعة، أو توزيع أو تعميم أية مواد لا أخلاقية، غير مناسبة وغير قانونية أومعلومات قد تسبب ضررا بأسماء أي أشخاص أو مؤسسات، أو الاعلان، أو البيع أو العرض لبيع أي منتجات أو خدمات، أو المشاركة في أي أفعال ضارة مثل المسح، أو المنافسة أو الرسائل المتسلسلة، وعدم ارسال أي معلومات أو برامج قد تؤدي الى الضرر بالمعلومات أو البرمجيات على أجهزة المستخدمين الآخرين. وكافة السجلات أو المواد التي يتم الحصول عليها بواسطة استخدام خدمات الموقع تكون ضمن موافقة المستخدم، وسوف يكون المستخدم مسؤولا تماماً عن أي اضرار أو فقد المعلومات أو أي خسائر اخرى ناتجة عن ذلك لجهاز كمبيوتر المستخدم، ولا يحق للمستخدم المطالبة بالتعويض عن أي خسائر تنشأ عن استخدام الخدمة، كما يلتزم بعدم استخدام خدمات الموقع لأي غرض تجارية أو إعلانية بدون الحصول على موافقة الموقع. كما يقر المستخدم بأنه على علم بأن الموقع قد يقوم بمراقبة كافة الانظمة في أي وقت او باستمرار و استخدام نظامه لأغراض تجارية. وعدم ارسال أي معلومات بالبريد الإلكتروني تكون محظورة قانونيا أو توزيع أي رسائل غير معتمد ارسالها مثل رسائل البريد المتسلسلة والبرامج الضارة ....الخ، وعدم تسجيل واساءة استخدام أي معلومات شخصية عائدة الى الاخرين. ان العضو نفسه مسؤول عن كافة انواع التصرفات التي يتم القيام بها تحت اسم "المستخدم". ويتعين على الاعضاء دفع رسوم الخدمة التي تم طلبها مسبقا عند تسليم المنتجات، وخلاف ذلك لن يتم تسليم المنتجات الى العملاء، وعدم الولوج الى الموقع او الخدمات باستخدام حساب/تسجيل طرف ثالث بدون موافقة صريحة من حامل الحساب، وعدم استخدام الموقع لأغراض غير قانونية، وعدم ارتكاب أي تصرفات مخالفة على الموقع او فيما يخص المحتوى على الموقع، وعدم استخدام الموقع للقيام بأي انشطة تجارية غير الاستخدام المصرح له لخدمات الموقع ، وعدم نسخ أي محتوى لاعادة النشر بشكل مطبوع او عبر الانترنت، وعدم انشاء مراجعات للموقع او تسجيل أي ادخالات لصالح او مع أي غرض تجاري او غرض اخر او قصد لا يتفق بنية حسنة مع غرض إنشاء الموقع، وعدم محاولة الحصول على حرية دخول غير مصرح بها الى انظمة كمبيوتر الاخرين من او عن طريق الموقع وعدم التدخل في استخدام شخص آخر أو جهات أخرى للموقع ، وعدم تحميل او نقل الفيروسات او الملفات الضارة والتخريبية او التدميرية الاخرى، و/او عدم تعطيل، التدخل في او حتى التسبب في ضرر أو مخالفة أمن الموقع، او أي خدمات، البرمجيات او الأجهزة المرتبطة بالنظام، الحسابات، كلمات السر، الخوادم او الشبكات المرتبطة بالموقع أو التي يتم الدخول إليها عن طريق المواقع أو المواقع الزميلة أو الموصلة (بما في ذلك تلك العائدة الى شركائنا من المطاعم). يتعين على كافة المستخدمين من القصر في المكان الذي يقيمون فيه (عموما تحت 18 سنة) الحصول على تصريح من ولي أمرهم، ويتم الاشراف عليهم مباشرة بواسطة ولي امرهم او الاب /الام عند استخدام الموقع. اذا كنت قاصر، يتعين على ولي امرك/ والدك قراءة هذه الاتفاقية والموافقة عليها قبل قيامك باستخدام الموقع على الشبكة. بطاقات الإئتمان أو الدفع المسبق التي يستخدمها العميل في السداد من خلال بوابة الدفع الإلكتروني على الموقع يتوجب أن تعود ملكيتها للعميل نفسه. في حال كانت ملكية البطاقة تعود لشخص آخر فيتوجب على العميل إستخدامها بصورة قانونية وذلك بموافقة صاحب البطاقة.',
                        style: TextStyle(
                             fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          'سلوك الزبائن',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Text(
                        'بخلاف المعلومات الشخصية، التي تم تغطيتها في سياسة الخصوصية لموقع الحفلة المميزة ، فإن أي مواد تقوم بارسالها او نشرها على هذا الموقع على الشبكة سوف تعتبر غير سرية وغير شخصية. ولن يكون على الموقع أي التزامات فيما يخص هذه المواد. وسوف يكون الموقع واي شخص نقوم بتعيينه الحرية لنسخ وتصحيح وتوزيع وتضمين أو أي استخدام خلاف ذلك لهذه المواد وكافة البيانات والصور والاصوات والنصوص والاشياء الاخرى المشمولة فيه لأي ولكافة الاغراض التجارية او غير التجارية. يحظر عليك نشر وتحميل أو ارسال إلى أو من الموقع على الشبكة أي من المواد التالية: تنتهك أي قانون محلي، وطني او دولي معمول به. غير مشروعة او احتيالية تصل الى حد الاعلان غير المصرح به او تحتوي على فيروسات او أي برامج اخرى ضارة. لا يجوز لك اساءة استخدام الموقع (بما في ذلك بواسطة القرصنة) أي تعليقات أو ملاحظات يضعها المستخدم على الموقع يجب ألا تحتوي على أي مواد تشهيرية، خليعة او مخالفة. تعزز العنف او التمييز وتنتهك حقوق الملكية الفكرية لشخص اخر. أو تنتهك أي واجب قانوني تجاه طرف ثالث (مثل واجب السرية) تعزز النشاط غير القانوني او تخترق خصوصية الاخر تقدم انطباعا انها صادرة عنا او يتم استخدامها لتقمص شخصية شخص اخر او تقديم معلومات خاطئة عن ارتباطك بشخص اخر إن التصرفات المحظورة الواردة في الفقرات اعلاه غير حصرية. وسوف تقوم بتعويض الموقع عن كافة النفقات والاضرار التي تتحملها كنتيجة لانتهاكك لأي من تلك القيود. سوف يقوم الموقع بالتعاون بالكامل مع أي جهات تنفذ القانون او قرارات المحكمة التي تطلب منا او توجهنا للتصريح عن هوية أو موقع أي شخص يقوم بنشر أي مواد بمخالفة الفقرات المذكورة أعلاه .',
                        style: TextStyle(
                            fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          'الانشطة المحظورة',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Text(
                        'لا يجوز لك الدخول الى او استخدام الموقع لاي غرض اخر بخلاف ذلك الذي يقوم الموقع بتوفيره. ان الموقع هو للاستخدام الشخصي للمستخدمين فقط ولا يجوز استخدامه بالارتباط مع أي مصالح تجارية باستثناء تلك التي تم اقرارها او اعتمادها تحديدا من الموقع. في حال إرتكاب المستخدم أي أنشطة محظورة، فإن الشركة لديها الحق في تعليق، أو منع أو إنهاء عضوية المستخدم ومنع دخوله إلى الخدمة. تتضمن الانشطة المحظورة ولا تقتصر على ما يلي: النشاط الجنائي او التقصيري، بما في ذلك الافلام الخلاعية للاطفال، الاحتيال، التجارة في المواد الخليعة، الاتجار في المخدرات، القمار، التحرش، المطاردة، البريد الالكتروني غير المرغوب فيه، انتهاك حقوق النشر، انتهاك براءات الاختراع او سرقة الاسرار المهنية. الاعلان او استدراج أي شخص لشراء او بيع أي منتجات او خدمات، ما لم يكن ذلك مصرح من الموقع. الاستعادة النظامية للبيانات او المحتويات الاخرى من الموقع على الشبكة لانشاء او تأليف، بشكل مباشر أو غير مباشر، مجموعة، مؤلف ، قاعدة بيانات، او دليل بدون أي تصريح خطي من الموقع. القيام بأي استخدام غير مصرح به لخدمات الموقع ، بما في ذلك جمع اسماء المستخدمين و/أو عناوين البريد الالكتروني للمستخدمين بواسطة وسائل الكترونية او اخرى لغرض ارسال بريد الكتروني غير مرغوب فيه. ‌‌المشاركة في أي صياغة غير مصرح بها او ربطها بالموقع. ‌ارسال رسائل متسلسلة او بريد الكتروني غير مرغوب فيه الى المستخدمين الاخرين. ‌استخدام أي معلومات يتم الحصول عليها من الموقع على الشبكة لكي يتم الاتصال، الاعلان عن، او استدراج او البيع الى أي مستخدم بدون موافقته الصريحة المسبقة. ‌المشاركة في أي استخدام اتوماتيكي للنظام مثل ارسال النصوص لاضافة الاصدقاء او ارسال الملاحظات او الرسائل او استخدام أي ادوات استخراج بيانات او ادوات جمع واستخراج بيانات اخرى. ‌التدخل في، تعطيل او انشاء عبء غير مبرر على الموقع او الشبكات او الخدمات المرتبطة بالموقع. ‌‌محاولة تقمص شخص او مستخدم اخر. ‌‌استخدام اسم المستخدم العائد الى شخص اخر. ‌‌بيع او بخلاف ذلك تحويل البيانات الخاصة بك. ‌استخدام أي معلومات تم الحصول عليها من الموقع لكي يتم مضايقة، الاساءة الى او الضرر بشخص اخر. ‌استخدام خدمة الموقع كجزء من أي جهد لمنافسة الموقع او تقديم الخدمات كمكتب خدمة. ‌فك شفرة، فك تأليف، تفكيك او عكس هندسة أي من البرمجيات التي يتكون منها الموقع أو تشكل جزءا من الموقع. ‌محاولة تجاوز أي اجراءات للموقع مصممة لمنع او تقييد الدخول الى الموقع او أي جزء من الموقع. مضايقة، ازعاج، ترهيب او تهديد للموقع من خلال أي وسيلة إتصال أو لأي موظفي او وكلاء تابعين للموقع أو من يشاركون في تقديم أي جزء من خدمات الموقع. ‌عرض اعلان او قبول مدفوعات او أي شيء ذي قيمة من الغير مقابل قيامك بأداء أي نشاط تجاري على او عن طريق الموقع نيابة عن ذلك الشخص، مثل نشر البلوجات أو النشرات ذات الغرض التجاري. ‌حذف حقوق النشر او اشعار حقوق الملكية الاخرى من أي مساهمة او محتوى على الموقع. ‌‌استخدام الموقع باي اسلوب لا يتفق مع أي وكافة القوانين واللوائح المعمول بها. أي إشتباه بالقيام بعمليات غير مشروعة على الموقع.',
                        style: TextStyle(
                            fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          'انهاء الاتفاقية',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Text(
                        'يجوز ان يقوم الموقع بإنهاء هذه الاتفاقية من جانب واحد في أي وقت',
                        style: TextStyle(
                           fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          'توصيل باقة الورد',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Text(
                        'اثناء أي عملية توصيل للمنتج يتم القيام بها الموقع، وفي حالة عدم تواجد الطرف المستلم في العنوان المحدد في النظام، لن يتم تسليم الباقة التي طلبها العميل الى أي مكان اخر. وفي هذه الحالة، يتعين على العضو قبول كافة المسؤوليات القانونية الناشئة عن طلب باقة إلى عنوان غير مرخص له الاستلام فيه.',
                        style: TextStyle(
                             fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          ' السعر والدفع',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Text(
                        'عند قبول طلبك، فإن ذلك يمثل اتفاق بينك كعميل وبين الموقع، ويتم الدفع النقدي مباشرةً للموقع حين نقوم بتلبية الطلب. وفي حالة اختيارك للدفع عن طريق بطاقة ائتمان أو الدفع المسبق عبر الموقع، عندئذ سيتم تنفيذ المعاملة من خلال الموقع، وسوف يتم احتساب رسوم التوصيل أو أي رسوم اخرى لكل طلب سوف يتم عرضها بوضوح في ملخص الطلب',
                        style: TextStyle(
                          fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,),
                      ),
                      Padding(
                        padding: const EdgeInsets.symmetric(vertical: 20),
                        child: Text(
                          'القانون والحاكم والاختصاص',
                          style: TextStyle(
                              fontFamily: 'hayah',
                              fontSize: 17,
                              color: Colors.black,
                              decoration: TextDecoration.underline,
                              fontWeight: FontWeight.w900),
                        ),
                      ),
                      Padding(
                        padding: const EdgeInsets.only(bottom: 20),
                        child: Text(
                          'تخضع شروط هذا الموقع وتفسر وفقا للقانون. وسوف تخضع النزاعات الناشئة والمتعلقة بشروط الموقع الماثلة (بما في ذلك النزاعات غير التعاقدية) الى الاختصاص الحصري للمحاكم في المملكة العربية السعودية ',
                          style: TextStyle(
                              fontFamily: 'GESSMED',
                          fontSize: 16,
                          color: const Color(0xff0c0101),
                          fontWeight: FontWeight.w500,
                          height: 1.875,),
                        ),
                      ),
                       ],
                     ),
                   )
                  ],
                 
                ),
              ),
            )),
      ),
    );
  }
}
